# Brewfile — all Homebrew-managed apps and CLI tools for this workstation.
# Installed by 'mm install' via 'brew bundle'. Fork note: replace this list
# with your own before running the installer.

# ── Casks: Development ──────────────────────────────────
cask "dash"
cask "github"
cask "gitkraken"
cask "intellij-idea"
cask "postman"
cask "visual-studio-code"

# ── Casks: AI / media ───────────────────────────────────
cask "chatgpt"
cask "claude"
cask "macwhisper"
cask "vlc"

# ── Casks: Communication / browser ──────────────────────
cask "discord"
cask "firefox"
cask "microsoft-teams"

# ── Casks: Security / networking ────────────────────────
cask "balenaetcher"
cask "cyberduck"
cask "malwarebytes"
cask "wireshark-app"

# ── Casks: System utilities ─────────────────────────────
cask "appcleaner"
cask "monitorcontrol"
cask "rectangle"
cask "utm"

# ── Casks: Data / modeling ──────────────────────────────
cask "mysqlworkbench"
cask "visual-paradigm"

# ── CLI: Development / shell productivity ───────────────
brew "bat"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "mas"
brew "pre-commit"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "yq"

# ── CLI: Python / AI ────────────────────────────────────
brew "ollama"
brew "pipx"
brew "uv"

# ── CLI: DevOps / containers / cloud-native ─────────────
brew "docker"
brew "docker-compose"
brew "trivy"

# ── CLI: Security / reverse engineering ─────────────────
brew "burp"
brew "ghidra"
brew "john-jumbo"
brew "sqlmap"
brew "virustotal-cli"

# ── CLI: Network / VPN ──────────────────────────────────
brew "nmap"
brew "openvpn"
brew "wget"
brew "wireshark"

# ── CLI: File / archive / document tools ────────────────
brew "dos2unix"
brew "exiftool"
brew "p7zip"
brew "pandoc"
brew "tesseract"
brew "tesseract-lang"
brew "weasyprint"

# ── CLI: Cross-platform administration ──────────────────
brew "powershell"
